InformationRegisters/CMS1C_ИзмененияСтатусовЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>CMS1C_ИзмененияСтатусовЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CMS1C_СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СинхронизироватьССайтом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СинхронизированССайтом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьПоПочтеКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленПоПочтеКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВебЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CMS1C_ИзмененияСтатусовЗаказов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаЗакрытьФорму(Команда)
	ЭтаФорма.Модифицированность = ЛОжь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименить(Команда)
	ЭтаФорма.Модифицированность = ЛОжь;
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.ПараметрЗапись) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Запись,Параметры.ПараметрЗапись);
	КонецЕСли;
	
	ИзменитьВидомостьДоступность();
КонецПроцедуры

Процедура СтатусПриИзмененииНаСервере()
	Запись.ОтправлятьПоПочтеКлиенту = Ложь;
	Запись.СинхронизироватьССайтом = Ложь;
	Запись.ОтправленПоПочтеКлиенту = Ложь;
	Запись.СинхронизированССайтом = Ложь;
	
	Запись.ОтправлятьПоПочтеКлиенту = Запись.Статус.ОтправлятьПоПочтеПоУмолчанию;
	Запись.СинхронизироватьССайтом = Запись.Статус.СинхронизироватьССайтомПоУмолчанию;
КонецПроцедуры

Процедура ИзменитьВидомостьДоступность()
	Элементы.СинхронизироватьССайтом.Доступность = Не Запись.СинхронизированССайтом;
	Элементы.ОтправлятьПоПочтеКлиенту.Доступность = Не Запись.ОтправленПоПочтеКлиенту;
	
	Элементы.НадписьСинхронизированССайтом.Заголовок = ФОрмат(Запись.СинхронизированССайтом,"БЛ=; БИ=СИНХРОНИЗИРОВАН");
	Элементы.НадписьОтправленПоПочте.Заголовок = ФОрмат(Запись.ОтправленПоПочтеКлиенту,"БЛ=; БИ=ОТПРАВЛЕН");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры
